{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_2", 0, 0]], "name": "model_2", "layers": [{"config": {"name": "input_2", "batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "block1_conv1", "strides": [2, 2], "dtype": "float32", "bias_constraint": null}, "name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block1_conv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block1_conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block1_conv1_act", "trainable": true, "dtype": "float32"}, "name": "block1_conv1_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "block1_conv2", "strides": [1, 1], "dtype": "float32", "bias_constraint": null}, "name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block1_conv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block1_conv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block1_conv2_act", "trainable": true, "dtype": "float32"}, "name": "block1_conv2_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 128, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block2_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block2_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block2_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block2_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block2_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block2_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 128, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block2_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block2_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block2_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block2_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "strides": [2, 2], "dtype": "float32", "bias_constraint": null}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"config": {"padding": "same", "trainable": true, "dtype": "float32", "name": "block2_pool", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last"}, "name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_4", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "name": "add_12", "class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block3_sepconv1_act", "trainable": true, "dtype": "float32"}, "name": "block3_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 256, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block3_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block3_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block3_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block3_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block3_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block3_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 256, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block3_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block3_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block3_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block3_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "name": "conv2d_5", "strides": [2, 2], "dtype": "float32", "bias_constraint": null}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"config": {"padding": "same", "trainable": true, "dtype": "float32", "name": "block3_pool", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last"}, "name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_5", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "name": "add_13", "class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block4_sepconv1_act", "trainable": true, "dtype": "float32"}, "name": "block4_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block4_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block4_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block4_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block4_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block4_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block4_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block4_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block4_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block4_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block4_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "name": "conv2d_6", "strides": [2, 2], "dtype": "float32", "bias_constraint": null}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"config": {"padding": "same", "trainable": true, "dtype": "float32", "name": "block4_pool", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last"}, "name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_6", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "name": "add_14", "class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block5_sepconv1_act", "trainable": true, "dtype": "float32"}, "name": "block5_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block5_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block5_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block5_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block5_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block5_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block5_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block5_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block5_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block5_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block5_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block5_sepconv3_act", "trainable": true, "dtype": "float32"}, "name": "block5_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block5_sepconv3", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block5_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block5_sepconv3_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block5_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]]}, {"config": {"name": "add_15", "trainable": true, "dtype": "float32"}, "name": "add_15", "class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_14", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block6_sepconv1_act", "trainable": true, "dtype": "float32"}, "name": "block6_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block6_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block6_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block6_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block6_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block6_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block6_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block6_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block6_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block6_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block6_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block6_sepconv3_act", "trainable": true, "dtype": "float32"}, "name": "block6_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block6_sepconv3", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block6_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block6_sepconv3_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block6_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]]}, {"config": {"name": "add_16", "trainable": true, "dtype": "float32"}, "name": "add_16", "class_name": "Add", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_15", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block7_sepconv1_act", "trainable": true, "dtype": "float32"}, "name": "block7_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_16", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block7_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block7_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block7_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block7_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block7_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block7_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block7_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block7_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block7_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block7_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block7_sepconv3_act", "trainable": true, "dtype": "float32"}, "name": "block7_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block7_sepconv3", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block7_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block7_sepconv3_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block7_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]]}, {"config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "name": "add_17", "class_name": "Add", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_16", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block8_sepconv1_act", "trainable": true, "dtype": "float32"}, "name": "block8_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block8_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block8_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block8_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block8_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block8_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block8_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block8_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block8_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block8_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block8_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block8_sepconv3_act", "trainable": true, "dtype": "float32"}, "name": "block8_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block8_sepconv3", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block8_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block8_sepconv3_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block8_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]]}, {"config": {"name": "add_18", "trainable": true, "dtype": "float32"}, "name": "add_18", "class_name": "Add", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_17", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block9_sepconv1_act", "trainable": true, "dtype": "float32"}, "name": "block9_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block9_sepconv1", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block9_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block9_sepconv1_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block9_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block9_sepconv2_act", "trainable": true, "dtype": "float32"}, "name": "block9_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": "block9_sepconv2", "depthwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null}, "name": "block9_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "axis": [3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "name": "block9_sepconv2_bn", "beta_constraint": null, "dtype": "float32", "scale": true, "center": true}, "name": "block9_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block9_sepconv3_act", "trainable": true, "dtype": "float32"}, "name": "block9_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null, "filters": 728, "depth_multiplier": 1, "activity_regularizer": null, "kernel_size": [3, 3], "pointwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "pointwise_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "name": 